tutorials/icoFoamAutoMotion/movingCone/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root ".";
    case "movingCone";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
movingWall
{
    type wall;
    physicalType wall;
    nFaces 85;
    startFace 3665;
}

farFieldMoving
{
    type patch;
    physicalType wall;
    nFaces 50;
    startFace 3750;
}

fixedWall
{
    type wall;
    physicalType wall;
    nFaces 35;
    startFace 3800;
}

axis
{
    type empty;
    physicalType empty;
    nFaces 0;
    startFace 3835;
}

left
{
    type patch;
    physicalType atmosphere;
    nFaces 30;
    startFace 3835;
}

farField
{
    type patch;
    physicalType fixedWall;
    nFaces 35;
    startFace 3865;
}

back
{
    type wedge;
    physicalType wedge;
    nFaces 1900;
    startFace 3900;
}

front
{
    type wedge;
    physicalType wedge;
    nFaces 1900;
    startFace 5800;
}
)

// ************************************************************************* //
